; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v1 - type_3 ?v2 - type_1)
 	      (pred_2 ?v8 - object ?v2 - type_1)
	      (pred_1 ?v1 - type_3 ?v4 - type_2)
	      (pred_3 ?v1 - type_3 ?v8 - object ?v4 - type_2))

   (:action op_3
       :parameters  (?v1 - type_3 ?v7 ?v5 - type_1)
       :precondition (and  (pred_4 ?v1 ?v7))
       :effect (and  (pred_4 ?v1 ?v5)
		     (not (pred_4 ?v1 ?v7))))

   (:action op_1
       :parameters (?v1 - type_3 ?v3 - object ?v6 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_2 ?v3 ?v6) (pred_4 ?v1 ?v6) (pred_1 ?v1 ?v4))
       :effect (and (pred_3 ?v1 ?v3 ?v4)
		    (not (pred_2 ?v3 ?v6)) 
		    (not (pred_1 ?v1 ?v4))))

   (:action op_2
       :parameters (?v1 - type_3 ?v3 - object ?v6 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v3 ?v4) (pred_4 ?v1 ?v6))
       :effect (and (pred_2 ?v3 ?v6)
		    (pred_1 ?v1 ?v4)
		    (not (pred_3 ?v1 ?v3 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_11 obj_08 - type_3
obj_10 obj_02 obj_03 obj_04 - type_2
obj_09 obj_05 obj_12 - type_1
obj_01 obj_07 obj_06 - object)
(:init
(pred_4 obj_11 obj_05)
(pred_1 obj_11 obj_10)
(pred_1 obj_11 obj_02)
(pred_4 obj_08 obj_05)
(pred_1 obj_08 obj_03)
(pred_1 obj_08 obj_04)
(pred_2 obj_01 obj_09)
(pred_2 obj_07 obj_05)
(pred_2 obj_06 obj_09)
)
(:goal
(and
(pred_2 obj_01 obj_05)
(pred_2 obj_07 obj_05)
(pred_2 obj_06 obj_12)
)
)

(:constraints
  (always (not (pred_4 obj_11 obj_12)))
)
)

; plan
1. (op_3 obj_11 obj_05 obj_09)
   deleted: (pred_4 obj_11 obj_05)
   added: (pred_4 obj_11 obj_09)
   goals met: 1 of 3
2. (op_1 obj_11 obj_06 obj_09 obj_02)
   deleted: (pred_2 obj_06 obj_09) (pred_1 obj_11 obj_02)
   added: (pred_3 obj_11 obj_06 obj_02)
   goals met: 1 of 3
3. (op_1 obj_11 obj_01 obj_09 obj_10)
   deleted: (pred_2 obj_01 obj_09) (pred_1 obj_11 obj_10)
   added: (pred_3 obj_11 obj_01 obj_10)
   goals met: 1 of 3
4. (op_3 obj_11 obj_09 obj_05)
   deleted: (pred_4 obj_11 obj_09)
   added: (pred_4 obj_11 obj_05)
   goals met: 1 of 3
5. (op_2 obj_11 obj_01 obj_05 obj_10)
   deleted: (pred_3 obj_11 obj_01 obj_10)
   added: (pred_2 obj_01 obj_05) (pred_1 obj_11 obj_10)
   goals met: 2 of 3
6. (op_2 obj_11 obj_06 obj_05 obj_02)
   deleted: (pred_3 obj_11 obj_06 obj_02)
   added: (pred_2 obj_06 obj_05) (pred_1 obj_11 obj_02)
   goals met: 2 of 3
7. (op_1 obj_08 obj_06 obj_05 obj_04)
   deleted: (pred_2 obj_06 obj_05) (pred_1 obj_08 obj_04)
   added: (pred_3 obj_08 obj_06 obj_04)
   goals met: 2 of 3
8. (op_3 obj_08 obj_05 obj_12)
   deleted: (pred_4 obj_08 obj_05)
   added: (pred_4 obj_08 obj_12)
   goals met: 2 of 3
9. (op_2 obj_08 obj_06 obj_12 obj_04)
   deleted: (pred_3 obj_08 obj_06 obj_04)
   added: (pred_2 obj_06 obj_12) (pred_1 obj_08 obj_04)
   goals met: 3 of 3
